package com.example.namelist.models;

import java.io.Serializable;
import java.util.ArrayList;

public class Name implements Serializable {
    private String name;
    private String birthdayDate;
    private String meaning;

    public Name(String name, String birthdayDate, String meaning) {
        this.name = name;
        this.birthdayDate = birthdayDate;
        this.meaning = meaning;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public String getBirthdayDate() {
        return birthdayDate;
    }

    public void setBirthdayDate(String birthdayDate) {
        this.birthdayDate = birthdayDate;
    }

    public String getMeaning() {
        return meaning;
    }

    public void setMeaning(String meaning) {
        this.meaning = meaning;
    }

    public static String[] getNames() {
        String[] names = {
                "Авраам", "Бенедикт", "Валерій", "Геннадій", "Давид", "Євген",
                "Іван", "Клавдій", "Леонід", "Мстислав", "Олексій", "Річард",
                "Святослав", "Тарас", "Федір", "Юрій"
        };

        return names;
    }

    public static String[] getBirthDays() {
        String[] birthdays = {
                "9 Жовтня",
                "27 Березня",
                "22 Березня, 6 Травня, 7 Листопада, 20 Листопада",
                "5 Лютого, 22 Лютого, 23 Лютого, 13 Вересня, 30 Листопада, 17 Грудня",
                "5 Січня, 11 Січня, 27 Січня, 8 Лютого, 13 Лютого, 5 Березня, 18 Березня, 25 Квітня, 15 Травня, 20 Травня, 31 Травня, 14 Червня, 8 Липня, 9 Липня, 6 Серпня, 18 Вересня, 19 Вересня, 2 Жовтня, 7 Жовтня, 15 Жовтня, 31 Жовтня, 14 Листопада",
                "21 Січня, 3 Лютого, 25 Лютого, 4 Березня, 10 Березня, 20 Березня, 3 Серпня, 8 Жовтня, 20 Листопада, 7 Грудня, 23 Грудня, 26 Грудня",
                "2 Січня, 11 Січня, 20 Січня, 28 Січня, 30 Січня, 3 Лютого, 4 Лютого, 6 Лютого, 8 Лютого, 9 Лютого, 12 Лютого, 13 Лютого, 17 Лютого, 19 Лютого, 23 Лютого, 5 Березня, 6 Березня, 8 Березня, 9 Березня, 11 Березня, 14 Березня, 18 Березня, 22 Березня, 23 Березня, 24 Березня, 29 Березня, 2 Квітня, 9 Квітня, 10 Квітня, 11 Квітня, 12 Квітня, 14 Квітня, 21 Квітня, 24 Квітня, 25 Квітня, 27 Квітня, 1 Травня, 2 Травня, 10 Травня, 19 Травня, 20 Травня, 21 Травня, 25 Травня, 26 Травня, 27 Травня, 1 Червня, 2 Червня, 6 Червня, 7 Червня, 8 Червня, 9 Червня, 11 Червня, 15 Червня, 17 Червня, 20 Червня, 22 Червня, 23 Червня, 25 Червня, 26 Червня, 2 Липня, 3 Липня, 7 Липня, 9 Липня, 10 Липня, 11 Липня, 13 Липня, 14 Липня, 16 Липня, 22 Липня, 25 Липня, 27 Липня, 31 Липня, 3 Серпня, 12 Серпня, 13 Серпня, 15 Серпня, 16 Серпня, 17 Серпня, 31 Серпня, 2 Вересня, 7 Вересня, 11 Вересня, 12 Вересня, 13 Вересня, 15 Вересня, 16 Вересня, 20 Вересня, 21 Вересня, 27 Вересня, 28 Вересня, 3 Жовтня, 6 Жовтня, 9 Жовтня, 14 Жовтня, 15 Жовтня, 16 Жовтня, 17 Жовтня, 25 Жовтня, 28 Жовтня, 1 Листопада, 3 Листопада, 4 Листопада, 6 Листопада, 10 Листопада, 14 Листопада, 22 Листопада, 25 Листопада, 26 Листопада, 30 Листопада, 3 Грудня, 11 Грудня, 12 Грудня, 15 Грудня, 16 Грудня, 17 Грудня, 20 Грудня, 23 Грудня, 24 Грудня, 30 Грудня",
                "13 Лютого, 16 Лютого, 22 Березня, 23 Березня, 1 Квітня, 18 Квітня, 16 Червня, 20 Червня, 24 Серпня, 11 Листопада, 20 Листопада, 31 Грудня",
                "23 Березня, 28 Квітня, 29 Квітня, 9 Червня, 18 Червня, 30 Липня, 21 Серпня, 12 Вересня, 15 Вересня, 28 Вересня",
                "27 Червня", "30 Березня", "7 Лютого, 3 Квітня, 20 Квітня, 1 Травня, 29 Травня, 9 Червня, 30 Липня, 22 Серпня, 30 Серпня, 31 Серпня, 22 Листопада, 1 Грудня",
                "16 Лютого, 6 Липня",
                "10 Березня, 22 Березня, 20 Червня, 15 Серпня, 25 Жовтня",
                "9 Січня, 27 Березня", "6 Травня, 9 Грудня"
        };

        return birthdays;
    }

    public static String[] getMeanings() {
        String[] meanings = {
                "Ім'я походить від єврейського Авраам, і означає: «батько». З іншого боку, ассірійською мовою воно означає «піднесений, як батько», тобто благородний. Абрам, Аврам, Авраам, Авраамій. У різних формах це ім'я увійшло у всі мови країн, населення яких сповідує іудаїзм, християнство чи іслам.",
                "Походить від латинського слова, що означає: благословенний. Це дуже добрі, спокійні, хоча й захопливі хлопчики, батькам з ними немає турбот. Розвиваються гармонійно, займаються спортом. У школі вчаться добре, вчителі не мають до них претензій. Люблять тварин.",
                "Ім’я має давньоримське походження, в перекладі – “сильний”. До нас прийшло з Візантії разом з християнством. Покровитель – святий мученик Валерій Севастійський. Разом з Іустином Філософом він боровся за святу віру. Був засуджений римським судом по помилковому звинуваченням у єресі і загинув в 166 році. Що стосується володаря даного імені, то зазвичай Валерій принциповий, наполегливий у досягненні мети, у всіх сферах діяльності досягає успіху. Він легко адаптується в будь-якій ситуації, швидко знаходить спільну мову з людьми, проте дружба для Валерія занадто символічна. Може бути, тому шлюб не приносить Валерію того задоволення, яке він отримує в роботі.",
                "Ім’я Геннадій походить від грецького слова «родовитий». Одержало широке розповсюдження на Русі після прийняття християнства. Святим заступником тих, хто носить це ім’я вважається священномученик Геннадій, патріарх Царградський.",
                "Це ім’я з давньоєврейське перекладається як «улюблений». У російських святцях заступником імені вважається Давид Солунський (Фессалонікійський), відлюдник. Преподобний Давид спочатку трудився в монастирі Пафнутія Боровського, потім на довгі роки зволів залишитися в самоті, відмовившись від мирської суєти і підносячись молитвами до Бога, заклинаючи Його відгородити від різного роду втіх і людських проблем.",
                "Це одне з найдавніших грецьких імен, переводиться воно як «благородний». У християнстві було надзвичайно популярним. Це ім’я зобов’язує його власника бути делікатним і тактовним до різних людей з усіх верств суспільства, але в той же час посуває на великі звершення.",
                "Ім’я Іван в перекладі з давньоєврейської означає «милість Божа». Канонічна форма – Іоан. У святцях вказані 63 святих з цим ім’ям (Іоан Предтеча, мученики Іоан Литовський, Іоан Новий, Іоан Валах, преподобний Іоанн Ветхопешернік та інші). На Русь ім’я прийшло з Візантії разом з християнством.",
                "«Зимові» – сильні, «літні» – спокійні, дипломатичні. З дитинства вони працелюбні. “Зимові” – гарні спортсмени, фанатичні, вперті. Не кар’єристи, йдуть до своєї мети довгим шляхом. У них багато друзів; «літні» страждають через свою довірливість. Вони не створюють конфліктних ситуацій, навпаки, допомагають іншим в біді. “Зимові” можуть відразу розірвати зв’язки з тим, хто їх зрадив. Це горді, рішучі люди, борці за справедливість.",
                "Ім’я Леонід в перекладі з давньогрецької означає «подібний до лева». Святий Леонід Єгипетський – християнський мученик IV в. Згідно з переказами, Леонід належав до знатного римського прізвища і володів чудовою красою. Він з дитинства вирішив присвятити себе Богу і помер в ім’я нього. Леонід – спритний, легкий у спілкуванні з різними людьми, спокійно пристосовується до будь-якого середовища і щасливий у справах.",
                "Ім’я Мстислав у перекладанні зі старослов’янського означає «славний месник». Святим заступником Мстислава вважається канонізований князь Мстислав Хоробрий, Удатний, який жив у XIII столітті, який славився своєю неперевершеною військовою доблестю. Мстислав самолюбний, егоїстичний, для розваги пожертвує хорошими стосунками з близькими.",
                "Покровитель цього дня мученик Олексій Константинопольський, що заслужив славу богоугодними справами. Але в народі більш відомий Алексій (Олексій), людина Божа, що народився 30 березня в родині знатного римлянина Евфреміана. Довгі роки проживши відлюдником, він повернувся в отчий будинок, проте родичі не впізнали його.",
                "Дитина з підвищеною емоційністю, батькам ні хвилини немає від неї спокою. Він вимагає постійно гострих відчуттів, особливо не бажає залишатися один. Хороший апетит, але іноді схильний до переїдання. Дуже рухливий, неврівноважений, пустотливий хлопчик – за ним потрібне око та око, а то обов’язково щось створить.",
                "Ім’я Святослав рідко використовувалося на Русі. Так називали дітей, що народилися в іменитих сім’ях, які принесли народу щастя, удачу, мир. Святослав – працьовита і талановита людина. Володіє вродженим тактом і делікатністю, проте легко ранимий і вразливий.",
                "Ім’я Тарас з давньогрецької перекладається як «неспокійний», «хвилюючий». Заступник імені – святитель Тарасій, патріарх Константинопольський. На прохання святого князя Володимира він прибув з Константинополя на Русь, щоб хрестити народ київський.",
                "У першу п’ятницю святої Четирехдесятниці співається канон на честь святого покровителя Федора Тирона. У цей день перед закінченням обідні виставляється посеред церкви і благословляється коливо – варені хлібні насіння з сухими плодами.",
                "Юрій – спокійний, декілька занурена в себе людина. Стримана поведінка і філософський склад розуму вступають в деяке протиріччя із зовнішнім виглядом. Жести, міміка, манера говорити відрізняються у Юрія деякою артистичністю. Жінки відразу відчувають до них розташування.",
        };

        return meanings;
    }

    public static ArrayList<Name> getNameList() {
        ArrayList<Name> names = new ArrayList<>();

        names.add(new Name(getNames()[0], getBirthDays()[0], getMeanings()[0]));
        names.add(new Name(getNames()[1], getBirthDays()[1], getMeanings()[1]));
        names.add(new Name(getNames()[2], getBirthDays()[2], getMeanings()[2]));
        names.add(new Name(getNames()[3], getBirthDays()[3], getMeanings()[3]));
        names.add(new Name(getNames()[4], getBirthDays()[4], getMeanings()[4]));
        names.add(new Name(getNames()[5], getBirthDays()[5], getMeanings()[5]));
        names.add(new Name(getNames()[6], getBirthDays()[6], getMeanings()[6]));
        names.add(new Name(getNames()[7], getBirthDays()[7], getMeanings()[7]));
        names.add(new Name(getNames()[8], getBirthDays()[8], getMeanings()[8]));
        names.add(new Name(getNames()[9], getBirthDays()[9], getMeanings()[9]));
        names.add(new Name(getNames()[10], getBirthDays()[10], getMeanings()[10]));
        names.add(new Name(getNames()[11], getBirthDays()[11], getMeanings()[11]));
        names.add(new Name(getNames()[12], getBirthDays()[12], getMeanings()[12]));
        names.add(new Name(getNames()[13], getBirthDays()[13], getMeanings()[13]));
        names.add(new Name(getNames()[14], getBirthDays()[14], getMeanings()[14]));
        names.add(new Name(getNames()[15], getBirthDays()[15], getMeanings()[15]));

        return names;
    }
}